{"home":"Home","charts":"Charts","upgrade":"Upgrade","logout":"logout","login":"Login","email":"Email","password":"Password","courseList":"Course List","nextLesson":"Next Lesson","prevLesson":"Previous Lesson","lessons":"Lessons","popularCourses":"Popular Courses","enrollNow":"Enroll Now","packages":{"beginner":{"title":"Beginner","description":"An introduction to the core concepts of trading the financial markets. This course will give you solid foundations to get you on the right path to becoming a successful and consistently profitable Trader. A perfect way to get you started."},"experienced":{"title":"Experienced","description":"Refine and perfect your skills. This course is designed to take your knowledge to the next level. It includes intermediate and advanced material to boost your trading performances, results and confidence."},"pro":{"title":"Pro","description":"Elevate your trading to the next level. This Advanced Trading Course is designed for those that are looking to become full-time traders and for professional traders who want to understand deeper market mechanic and diversify their portfolio with profitable stocks."},"bundle":{"title":"Bundle","description":"Get all the packages in one deal! This Beginner to Expert Course is designed to take newbies to a professional level. This course includes beginner, intermediate and advanced material to give you all the knowledge and confidence to produce profitable and consistent results."}},"courses":{"fibonacci-part-1":{"title":"Fibonacci - Part 1"},"fibonacci-part-2":{"title":"Fibonacci - Part 2"},"advanced-stock-market-trading-level-1-part-1":{"title":"Advanced Stock Market Trading - Level 1 - Part 1"},"advanced-stock-market-trading-level-1-part-2":{"title":"Advanced Stock Market Trading - Level 1 - Part 2"},"advanced-stock-market-trading-level-1-part-3":{"title":"Advanced Stock Market Trading - Level 1 - Part 3"},"advanced-stock-market-trading-level-1-part-4":{"title":"Advanced Stock Market Trading - Level 1 - Part 4"},"advanced-stock-market-trading-level-2-part-1":{"title":"Advanced Stock Market Trading - Level 2 - Part 1"},"advanced-stock-market-trading-level-2-part-2":{"title":"Advanced Stock Market Trading - Level 2 - Part 2"},"advanced-stock-market-trading-level-2-part-3":{"title":"Advanced Stock Market Trading - Level 2 - Part 3"},"top-trader-part-1":{"title":"Top Trader - Part 1"},"top-trader-part-2":{"title":"Top Trader - Part 2"},"understanding-multiple-time-frame-analysis-mtfa-part-1":{"title":"Understanding Multiple Time Frame Analysis (MTFA) - Part 1"},"understanding-multiple-time-frame-analysis-mtfa-part-2":{"title":"Understanding Multiple Time Frame Analysis (MTFA) - Part 2"},"understanding-multiple-time-frame-analysis-mtfa-part-3":{"title":"Understanding Multiple Time Frame Analysis (MTFA) - Part 3"},"timing-in-forex-part-1":{"title":"Timing in Forex - Part 1"},"chart-formation-patterns-part-1":{"title":"Chart Formation Patterns - Part 1"},"chart-formation-patterns-part-2":{"title":"Chart Formation Patterns - Part 2"},"chart-formation-patterns-part-3":{"title":"Chart Formation Patterns - Part 3"},"chart-formation-patterns-part-4":{"title":"Chart Formation Patterns - Part 4"},"introduction-to-the-stock-market-part-1":{"title":"Introduction to the Stock Market - Part 1"},"introduction-to-the-stock-market-part-2":{"title":"Introduction to the Stock Market - Part 2"},"introduction-to-the-stock-market-part-3":{"title":"Introduction to the Stock Market - Part 3"},"introduction-to-the-stock-market-part-4":{"title":"Introduction to the Stock Market - Part 4"},"cryptocurrencies-part-1":{"title":"Cryptocurrencies - Part 1"},"cryptocurrencies-part-2":{"title":"Cryptocurrencies - Part 2"},"cryptocurrencies-part-3":{"title":"Cryptocurrencies - Part 3"},"cryptocurrencies-part-4":{"title":"Cryptocurrencies - Part 4"},"cryptocurrencies-part-5":{"title":"Cryptocurrencies - Part 5"},"understanding-fundamental-analysis-part-1":{"title":"Understanding Fundamental Analysis - Part 1"},"understanding-fundamental-analysis-part-2":{"title":"Understanding Fundamental Analysis - Part 2"},"technical-analysis-part-1":{"title":"Technical Analysis - Part 1"},"technical-analysis-part-2":{"title":"Technical Analysis - Part 2"},"fxmarket-analysis-part-1":{"title":"FXMarket Analysis - Part 1"},"fxmarket-analysis-part-2":{"title":"FXMarket Analysis - Part 2"},"fxmarket-analysis-part-3":{"title":"FXMarket Analysis - Part 3"},"forex-indicators-part-1":{"title":"Forex Indicators - Part 1"},"forex-indicators-part-2":{"title":"Forex Indicators - Part 2"},"forex-indicators-part-3":{"title":"Forex Indicators - Part 3"},"forex-indicators-part-4":{"title":"Forex Indicators - Part 4"},"understanding-candlesticks-part-1":{"title":"Understanding Candlesticks - Part 1"},"understanding-candlesticks-part-2":{"title":"Understanding Candlesticks - Part 2"},"basic-forex-education-part-3":{"title":"Basic Forex Education - Part 3"},"mt5-part-1":{"title":"MT5 - Part 1"},"mt5-part-2":{"title":"MT5 - Part 2"},"basic-forex-education-part-2":{"title":"Basic Forex Education - Part 2"},"basic-forex-education-part-1":{"title":"Basic Forex Education - Part 1"},"understanding-candlesticks-part-3":{"title":"Understanding Candlesticks - Part 3"},"understanding-candlesticks-part-4":{"title":"Understanding Candlesticks - Part 4"}},"lessonData":{"forex-fibonacci-extensions":{"title":"Forex Fibonacci Extensions","description":"You might be using some basic tools in trading, but when it comes to Fibonacci Forex trading there are some additional extensions you can use. At TraderCademy you can learn which kinds of extensions to use, and how to benefit from that in currency trading."},"fibonacci-lesson":{"title":"Fibonacci Lesson","description":"Fibonacci trading is one of the most popular but also the most difficult trading style to master. The concept is quite complicated, which is why we decided to provide a full overview before we further discuss its relationship with trading, especially with Forex."},"learn-fibonacci-fans-and-arcs":{"title":"Learn Fibonacci Fans and Arcs","description":"The Fibonacci trader community is very particular about their trading. In this lesson you will be able to learn about the Fibonacci Fans and Arc for Forex trading. With this information, you should be able to learn more about the art of Fibonacci trading."},"learn-forex-combining-fibonacci-with-other-technical-analysis-tools":{"title":"Learn Forex Combining Fibonacci with Other Technical Analysis Tools","description":"What kind of tools can you use in Fibonacci trading? Well, there are many different options, but it depends on which kind of analysis you prefer. We decided to share our secrets for the most advised type of trading in this case, called Technical Analysis."},"market-indicators":{"title":"Market Indicators","description":"You need to consider various market indicators in advanced stock trading. In this lesson, we will discuss their importance and significance."},"trading-methodology":{"title":"Trading Methodology","description":"Understanding trading methodology in advanced stock trading is vital. In this lesson, you will learn the different methodologies and their correct use."},"round-numbers":{"title":"Round Numbers","description":"Round Numbers predict a very specific type of phenomenon in trading, and seeing them in your trades might be able to tell you things you never thought could be true."},"setting-up-a-trade":{"title":"Setting up a Trade","description":"In this lesson, we will teach you how to set up your trades right and how to take advantage of the market by examining the minor details many traders miss."},"technical-analysis-for-professional-traders":{"title":"Technical Analysis for Professional Traders","description":"We will share the secrets of technical analysis that professional traders use. We will teach you to look at numbers from a different perspective."},"practical-technical-analysis":{"title":"Practical Technical Analysis","description":"Practical technical analysis provides a lot more information than you may expect. That is because it is a combination of several other types of analysis."},"trading-psychology":{"title":"Trading Psychology","description":"Trading psychology will show you what sort of moves traders prefer to make and at what time they make them. Thus, you will have a chance to remain a step ahead."},"risk-position-management":{"title":"Risk & Position Management","description":"Risk and position management do exactly what you think - manage risk and position. But why is that such a big deal?"},"picking-stocks-analysing-economic-data":{"title":"Picking Stocks & Analysing Economic Data","description":"If you are not a fan of fundamental analysis, you will definitely need to learn how to analyze economic data for predicting the future of your stocks."},"intra-day-trading":{"title":"Intra-Day Trading","description":"Through trial and error, traders came up with a type of strategy that brings more profits but requires more work. It's called intra-day trading."},"trading-arbitrage":{"title":"Trading Arbitrage","description":"This is a form of trading in which you seek profits through discrepancies of identical instruments. What does that mean?"},"trading-preparation-sectors":{"title":"Trading Preparation & Sectors","description":"Prepare for your trades the right way through this mini-manual we have prepared. Consider the right sectors. Use the correct form of analysis."},"trading-small-caps":{"title":"Trading Small Caps","description":"Some of the glossary might seem a little confusing and scary, but we have found a way to explain everything thoroughly in a way that avoids any confusion."},"identifying-institutional-tactics-and-copying-them":{"title":"Identifying Institutional Tactics and Copying Them","description":"Why is it important to identify institutional tactics, and what does copying them do for your trades?"},"using-hot-keys":{"title":"Using Hot Keys","description":"In the second level of this course, we will discuss hot keys and their importance. Though often ignored, they are quite important in trades."},"advanced-use-of-time-sale":{"title":"Advanced Use of Time & Sale","description":"Time and Sale is a regular term in trading, but when it comes to advanced trading it might mean more than you think. Learn about it with us."},"manage-watch-lists":{"title":"Manage \"Watch Lists\"","description":"Watch lists seems easy to handle. But there is a specific strategy that ties into the level one part of this course."},"the-fixed-quantities-paradox":{"title":"The Fixed Quantities Paradox","description":"The paradox arises when a fixed charge creates a risk due to demand. How can you use it to your advantage in your stock trades?"},"identifying-trade-traps":{"title":"Identifying \"Trade Traps\"","description":"Many traders fall for trade traps. Fortunately, in this lesson, we will teach you how to identify them and avoid them at all costs."},"the-2020-method-how-do-experts-read-charts":{"title":"The \"20:20\" Method - How do Experts Read Charts?","description":"This entire title may seem too intimidating , but with our help you can tackle the 20:20 method without any issues."},"how-to-trade-using-failure-patterns":{"title":"How to Trade Using Failure Patterns","description":"It is true that the more you fail the more you learn, so use your failure patterns to improve your trading."},"using-nrm-and-wrb-candles":{"title":"Using NRM and WRB Candles","description":"Learn how to read NRB and WRB candles and use them during your trades. Find out how they will come in handy when you are taking part in advanced stock trading."},"trading-ipos-day-trading-and-swing-trading":{"title":"Trading IPOs: Day Trading and Swing Trading","description":"Though there are a lot of different trading strategies, day trading and swing trading are some of the most common in stock trading."},"advanced-trading-and-technical-analysis":{"title":"Advanced Trading and Technical Analysis","description":"If you can put together a sentimental, fundamental and technical analysis, then you will develop the necessary analytical skills that top traders use. Do not be scared, everything can be learned through practice!"},"advanced-stock-trading-strategies-the-trailing-stop":{"title":"Advanced Stock Trading Strategies - The Trailing Stop","description":"Learn how to manipulate your strategy to help coax it into a trailing stop type strategy. It's considered advanced for a reason, and learning how to manage it will guarantee higher profits."},"pivot-points-in-stock-trading":{"title":"Pivot Points in Stock Trading","description":"In stock trading, pivot points often make or break your trades. So, make sure you have a strong understanding of what they are and how to identify them."},"trade-according-to-game-theory":{"title":"Trade According to Game Theory","description":"Game theory has played a crucial role in trading strategies for some time now. Thus, being able to apply it correctly in practice is crucial. Learn with us."},"practice-vwap-strategies":{"title":"Practice VWAP Strategies","description":"Practice this strategy with us in order to learn how to take advantage of the volume-weighted average prices over short-time frames."},"trade-management":{"title":"Trade Management","description":"Trade Management is very handy when you conduct certain types of analysis. So watch this video to make sure you know how to do it right."},"understanding-multiple-time-frame-analysis-mtfa":{"title":"Understanding Multiple Time Frame Analysis (MTFA)","description":"Knowing and understanding are two completely different things, especially when it comes to MTFA. Make sure you understand it well before you dive into this analysis."},"analyzing-the-market":{"title":"Analyzing the Market","description":"Looking at MTFA in your asset's market will help you predict some patterns, but MTFA is not enough for profitable trading."},"what-is-mtfa":{"title":"What is MTFA?","description":"Though it sounds quite complicated, it's not as bad as you think. The process of MTFA is simply a history-based analysis."},"using-long-term-time-frames":{"title":"Using Long-term Time Frames","description":"Similar to the medium-term frames, you can learn and use long-term time frames in your MTFA."},"rule-of-four":{"title":"Rule of Four","description":"Though it's not really a set rule, the rule of four in MTFA definitely makes a huge difference for traders who use MTFA in their analysis."},"using-medium-term-time-frames":{"title":"Using Medium-term Time Frames","description":"Using Medium-term time frames create a specific type of gap in MTFA. How can you use it and get the most significant profit possible?"},"conclusion":{"title":"Conclusion","description":"Since this is the end of the course, we decided to combine all of the information and give you more tips to successfully implement MTFA."},"combining-all-three":{"title":"Combining All Three","description":"What is the best and most successful way to combine all of the time-frames in MTFA? Make sure you really learn this thoroughly so you don't end up making any crucial mistakes."},"using-short-term-time-frames":{"title":"Using Short-term Time Frames","description":"Though a little different from longer time frames, short-term time frames provide a different type of information about the asset."},"timing-your-entries-when-trading-forex":{"title":"Timing your Entries When Trading Forex","description":"Though entries are crucial in every market, when it comes to forex trading timing your entry is the most important aspect. But how can you know when to begin your trades and when to stop? This is a skill that must be developed through hands on trading, but we can teach you the most important things to consider before you begin trading yourself."},"timing-in-forex":{"title":"Timing In Forex","description":"Is timing your entry the only aspect you need to consider in timing? No, when it comes to forex there are more things to think about. When do you stop, or when do you see a potential in a currency pair? How can you develop these skills through trading? Learn all of this here."},"forex-double-top-and-double-bottom-formation-patterns":{"title":"Forex Double Top and Double Bottom Formation Patterns","description":"This chapter will show you how to identify Top and Double Bottom Formation patterns. Remember that the double top is a reversal pattern. Usually, it is formed after there is an extended move up. However, the double bottom is a trend that goes long and low. Click on the video and learn how to notice these trend reversal formations and then act accordingly."},"learn-forex-head-and-shoulders-pattern":{"title":"Learn Forex Head and Shoulders Pattern","description":"Hop on this lesson and learn another fascinating trend reversal formation. The pattern is forged by a peak (that looks like a shoulder), followed by a higher peak (the head), and then another lower peak (second shoulder). This pattern helps traders calculate a target by measuring the high point of the head to the neckline. Click on the video to find out even more."},"forex-inverse-head-and-shoulders-pattern":{"title":"Forex Inverse Head and Shoulders Pattern","description":"In the previous chapter, we have learned about the Head and Shoulders Pattern. This video lesson will explain the meaning of the Inverse Head and Shoulder Pattern indicator. Usually, on all time frames in all markets, and is mostly associated with the reversal of a downward trend. Click on the video to find out even more."},"forex-bull-flag-formation-patterns":{"title":"Forex Bull Flag Formation Patterns","description":"This video lesson will teach you how to identify bull flag formation patterns in forex. You'll be able to figure out the Bull Flag pattern's movements in addition to all the movements it makes before bearish correction. Thanks to our video lesson, you will know when to expect a continuation of the prevailing bullish trend."},"forex-bear-flag-patterns":{"title":"Forex Bear Flag Patterns","description":"Keep in mind that each chart pattern provides the trader with a unique outlook on potential price movement. The Bear Flag is a bearish chart pattern. A Bear Flag pattern signals the market is likely to head lower. The opposite is called a Bull Flag. In this lesson, you'll learn how to identify a Bear Flag Pattern and then move accordingly to the market momentum"},"forex-bullish-and-bearish-pennant-formation":{"title":"Forex Bullish and Bearish Pennant Formation","description":"The Pennant is formed from an upward flagpole. They are continuation patterns that appear in the forex market. This lesson will provide you with knowing how to predict the upcoming market movements with these kinds of patterns. You'll learn how to recognize bearish and bullish pennant patterns, what they mean, and how you can use them to your advantage"},"forex-falling-wedge-pattern":{"title":"Forex Falling Wedge Pattern","description":"The falling wedge is where the bears are in control, making lower highs and lower lows. This chapter will explain how to predict the market movements during this specific pattern. In other words, you'll learn how to notice the slightest market changes and resistance arrangements within a fallen Wedge Pattern."},"forex-ascending-and-descending-triangle-formations":{"title":"Forex Ascending and Descending Triangle Formations","description":"If you want to become the very best trader, you should have a complete understanding of chart pattern trading. Moreover, you should learn about one of the most common on-chart formations. The triangle pattern is a specific figure formed on the price chart. They are typically identified when the tops and the bottoms meet. In this lesson, you'll learn about the difference between all kinds of triangles that can be seen on Forex charts."},"forex-symmetrical-triangle-pattern":{"title":"Forex Symmetrical Triangle Pattern","description":"As we've said in previous chapters, there are different types of triangle patterns. Symmetrical triangles consist of two lines of an equal slope, turning to a point in the future. In its final form, it appears as a sideways triangle with the base to the left and the point the right. This video lesson will explain why these Symmetrical Triangles are so important."},"forex-cup-and-handle-formation-pattern":{"title":"Forex Cup and Handle Formation Pattern","description":"You want to know what does the cup, and handle formation mean? Click on this video and find out yourself. This chapter will explain how to distinguish these technical indicators on bar charts. The pattern usually occurs during selling pressure from investors who previously bought at price levels. Usually, a cup and handle is a bullish continuation pattern and is used to identify buying opportunities."},"forex-rising-wedge-pattern":{"title":"Forex Rising Wedge Pattern","description":"As a future trader, remember that chart patterns are a crucial component of technical analysis. In this chapter, you'll learn that wedges usually signal a pause in the current trend. Whenever you see this formation, it signals that forex traders are still deciding and thinking where to take the pair, next."},"forex-box-range":{"title":"Forex Box Range","description":"The British Box Breakout is a forex trading strategy. It may sound complicated, but it is a surprisingly simple and very effective trading method. This video lesson will provide you with information on the principles of \"breakout trading.\" It'll help you figure out the main characteristics of this specific range and how to successfully use it to your advantage."},"forex-inverse-cup-and-handle-pattern":{"title":"Forex Inverse Cup and Handle Pattern","description":"You want to know what the inverse cup and handle formation mean? Click on this video and find out yourself. This chapter will explain how to distinguish these technical indicators from their upright formations on bar charts."},"introduction-to-the-stock-market":{"title":"Introduction to the Stock Market","description":"Since stocks behave in a very similar manner, understanding the general stock market is not hard, but knowing the analytical part is crucial."},"predicting-the-future-trading-systems-with-stock-charts":{"title":"Predicting the Future & Trading Systems with Stock Charts","description":"Though it might seem unlikely, it is somehow possible to predict the future. However, do not mistake this with historical repetitiveness."},"support-and-resistance-levels":{"title":"Support and Resistance Levels","description":"Support and resistance show us where the asset is and where it will likely go next. Make sure to have a good grasp of this 101 stock market lesson to ensure you understand the rest clearly."},"how-to-identify-a-markets-direction-part-1":{"title":"How to Identify a Market's Direction - Part 1","description":"The first step to predicting the direction is by identifying the chart formation, after which you can identify the approximate oncoming drop."},"how-to-identify-a-markets-direction-part-2":{"title":"How to Identify a Market's Direction - Part 2","description":"After you have identified any chart formation, you can actually move on to finding the actual direction - bearish or bullish."},"chart-patterns-introduction":{"title":"Chart Patterns - Introduction","description":"Although there are endless chart formations, let us show you the most common ones that you need to know before moving on to more complicated technical analysis."},"chart-patterns-symmetrical-triangles":{"title":"Chart Patterns - Symmetrical Triangles","description":"Symmetrical triangles have a very specific shape, and they predict a huge change in the market. Learn how to identify them."},"chart-patterns-symmetrical-triangles-trading-strategy":{"title":"Chart Patterns - Symmetrical Triangles Trading Strategy","description":"What sort of information can you extract from symmetrical triangles that will help improve your strategy?"},"chart-patterns-flags-and-pennants":{"title":"Chart Patterns - Flags and Pennants","description":"It is crucial to identify flags and pennants in your live charts before everyone else to be able to take advantage of them. Learn how."},"chart-patterns-flags-and-pennants-trading-strategy":{"title":"Chart Patterns - Flags and Pennants Trading Strategy","description":"Now that you know how to identify flags and pennants, you can actually implement them into your trading strategy."},"chart-patterns-ascending-triangles":{"title":"Chart Patterns - Ascending Triangles","description":"Though symmetrical and ascending triangles might look similar, identifying their differences is crucial in trading."},"chart-patterns-ascending-triangles-trading-strategy":{"title":"Chart Patterns - Ascending Triangles Trading Strategy","description":"Though similar, the differences between the implementation of ascending and symmetrical triangles are crucial."},"volumes-and-trends":{"title":"Volumes and Trends","description":"Learn the true definition of volumes and trends. Find out why they are important in the stock market and let us help you take advantage of upcoming trends."},"background-early-digital-currencies-1980-2009":{"title":"Background - Early Digital Currencies (1980-2009)","description":"If we were to tell you the history of digital currencies, we're going to have to go back 25 years. We will begin from the creation of the blinding algorithm, to the birth of Bitcoin. The eleventh module of our Cryptocurrency course goes over the crucial factors that led to the technical foundations of virtual currencies today."},"background-the-concept-of-owning-a-digital-currency":{"title":"Background - The Concept of Owning a Digital Currency","description":"Despite cryptocurrencies' rapid growth, we are witnessing an evolving market that is in its early stages. That's good news, as there are several potential benefits for investors in cryptocurrency. Although, it could be risky for those who are unfamiliar with this market. This part will cover what you need to know and understand about digital currencies. This includes, but is not limited to the general idea of owning digital currencies, how they're used, and the concept of blockchain among others."},"evolution-of-blockchain-and-cryptocurrencies":{"title":"Evolution of Blockchain and Cryptocurrencies","description":"Blockchain and cryptocurrencies have grown so popular these days that they managed to catch the attention of multiple markets and industries around the globe. This module will familiarize you with the emerging technology of blockchain and cryptocurrencies, their technology, as well as their potential to transform the financial services sector."},"the-future-of-digital-currencies-and-blockchain":{"title":"The Future of Digital Currencies and Blockchain","description":"It's a common trope that cryptocurrencies are, \"disrupting the financial industry\" and will lead to the new future of financial inclusion. Still, how can we picture a future like that? This chapter has some ways that could help us analyze the possible future of not only digital currencies, but the blockchain technology as well."},"what-are-wallets-and-how-do-they-work":{"title":"What are \"Wallets\" and How Do They Work?","description":"Cryptocurrency wallets play a vital role in securing your digital currency and tokens. So, if you're trying to find secure locations to store your cryptocurrency, then this module can help you with that. As the name suggests, this lesson will detail what you need to know about digital wallets and how they work, as well as the pros and cons of each wallet type i.e., online, desktop, mobile, hardware, and paper."},"backups-offline-storage-why-is-it-important-and-how-do-you-do-it":{"title":"Backups & Offline Storage - Why Is It Important and How Do You Do It?","description":"Knowing that cryptocurrency wallets are not completely safe from cyber-attacks, you'll need to employ safety precautions and be sure to follow them whenever you're using a wallet. That's where this module comes in. This lesson will introduce you to secure options to store digital assets and find out how each is done."},"mobile-security-how-to-safely-protect-your-mobile-wallet":{"title":"Mobile Security - How to Safely Protect your Mobile Wallet","description":"Not performing the necessary precautions for your mobile wallet could result in the loss of your cryptocurrencies, and that's why, the protection of your private key matters. Lesson 7 dives into details on security measures that you can apply to keep your cryptocurrency wallet out of the reach of hackers."},"types-of-crypto-currencies":{"title":"Types of Crypto Currencies","description":"There are various cryptocurrencies circling in the current market. However, these cryptocurrencies are those that have gained popularity amongst investors. The ninth module of our Cryptocurrency course will provide you a breakdown of each of the highly traded digital currencies, how they work, as well as how they can be used."},"how-to-invest-in-bitcoin":{"title":"How to Invest in Bitcoin","description":"The second chapter of this course will take cryptocurrency trading step by step and help you see the big picture of the digital currency market. Lesson 2 will show you the proper way of gathering information about the coins you're interested in, how to distribute your capital wisely, how to keep your wallet protected from unauthorized users, and more."},"what-is-bitcoin":{"title":"What is Bitcoin?","description":"This part is for learners who would like to be able to navigate their way into the Bitcoin market, or those who are interested in learning how the latest technology can drive changes in the financial industry. We'll start with a brief overview of the history and concept of Bitcoin. We will then proceed to help you gain further information about Bitcoin as both a currency and technology."},"the-history-of-bitcoin":{"title":"The History of Bitcoin","description":"Bitcoin has taken a long and winding road since its 2009 launch, and yet a lot of people are still not sure as to where this cryptocurrency came from and how it evolved to become one of the well-known virtual currencies today. Learn from history, and you may just lower your chances of repeating its mistakes. With that in mind, here's a little history lesson of Bitcoin for you."},"ways-to-use-bitcoin-besides-investing":{"title":"Ways to Use Bitcoin Besides Investing","description":"The notion that Bitcoin is designed to do something much more is somewhat getting lost, amid the digital currency hype. That's why, we'll introduced you to some of the other uses of Bitcoin. They will provide further reasons as to why you should own Bitcoins aside from their potential to grow in value."},"what-are-the-risks-involved-in-bitcoin-trading":{"title":"What are the Risks Involved in Bitcoin Trading","description":"While Bitcoin offers several benefits, such as ease of access, low-priced transactions, secured banking processes, etc., it still has a few hurdles to deal with like its limited use, regulations, cybersecurity matters, and more. Lesson 4, in a nutshell, acts as guideline to ensuring that your bitcoin trading is performed in a secured environment."},"how-to-buy-bitcoin":{"title":"How to Buy Bitcoin","description":"If you're considering buying and selling Bitcoin, but you are unsure where to begin, then you have come to the right place. We developed this session to teach interested members how to approach the whole Bitcoin process from scratch. Step by step, we will address how to buy your first Bitcoin, how to sell and invest them, how to cash them out, etc."},"why-accept-bitcoin":{"title":"Why Accept Bitcoin?","description":"Throughout this session, we'll be determining the factors that encourage individuals and businesses to adapt Bitcoin as a payment method. Topics concerning the legal aspects of accepting Bitcoin and the methods that can allow companies or individuals to start integrating the digital currency will be included in the discussion as well."},"what-are-the-risk-involved-in-using-bitcoin":{"title":"What are the Risk Involved in Using Bitcoin","description":"Despite its popularity and positive performance, choosing to invest in Bitcoin is serious business that carries several risks. So, before you invest in this virtual currency or proceed with your plan to own a significant amount of it, first, let us help you identify the risks associated with using Bitcoins."},"how-to-accept-bitcoin-for-services-of-goods":{"title":"How to Accept Bitcoin for Services of Goods","description":"Being another method of online payment, Bitcoin is widely utilized by online consumers. However, Bitcoin requires an initial setup from those who seek to integrate it into their companies. This part of the course outlines why you should accept the digital currency as a seller, what tools you need to adapt it into your business, how to enable Bitcoin payments for your store, and more."},"outlook-on-taxation-accounting-legalities":{"title":"Outlook on Taxation, Accounting & Legalities","description":"The founding of Bitcoin and other cryptocurrencies like Litecoin, Ripple, Ethereum, and more has resulted in many discussions concerning their future. Virtual currencies that aims to join the mainstream financial system would need to meet divergent standards. While the outlook still seems far from happening, the success or failure of cryptocurrencies in addressing their respective issues might determine their circumstances in the coming years."},"understanding-fundamental-analysis":{"title":"Understanding Fundamental Analysis","description":"Fundamental analysis is one of the most common forms of analysis, though do not let that trick you into thinking it's easy."},"significance-of-news":{"title":"Significance of News","description":"Whales jump in and take over markets, bulls and bears manipulate sheep into trading. Make sure you understand the significance of news in your trades, so you do not fall for covertly forced market moves."},"fundamental-analysis-key-economic-indicators":{"title":"Fundamental Analysis: Key Economic Indicators","description":"Fundamental analysis takes into account many economic indicators, but some are key to making profits. Learn them here with us."},"interest-rates":{"title":"Interest Rates","description":"Consider interest rates to be one of the biggest factors in your fundamental analysis. Learn how to use it to your advantage, but stay cautious to ensure the growth of profits."},"conclusion-2":{"title":"Conclusion","description":"What else do you need to know to be able to use fundamental analysis correctly without being tricked?"},"manipulating-interest-rates":{"title":"Manipulating Interest Rates","description":"Fundamental analysis tries to consider everything in a strategy, and manipulating the interest rates is a big factor. Learn how to avoid assets controlled by whales."},"inflation":{"title":"Inflation","description":"There's always a silver lining. Inflation might seem like a bad thing overall, but in trading, it turns out it can be quite useful. Learn how inflation will affect your fundamental analysis."},"gdp":{"title":"GDP","description":"How does GDP impact assets, and how can you use it in your fundamental analysis? It might seem complicated, but don't worry, we have found an easy way to explain it to you."},"understanding-technical-analysis":{"title":"Understanding Technical Analysis","description":"Use past information to build technical stats that will help you create an approximate futures values of an asset. Make profits by predicting the market."},"basic-components":{"title":"Basic Components","description":"What's considered basic in technical analysis? Well, there are many components that go into the whole analysis itself, but it also depends on how you go about doing it."},"technical-analysis-in-decision-making":{"title":"Technical Analysis in Decision-Making","description":"Though it might be hard to grasp, technical analysis is one of the most important aspects to consider while making decisions. See why."},"what-technical-analysis-can-contribute":{"title":"What Technical Analysis Can Contribute","description":"Use technical analysis to your advantage. With this type of analysis, you can recognize patterns through hard facts and the history of your asset."},"technical-indicators":{"title":"Technical Indicators","description":"Since FX is a separate market, it requires a specific type of technical indicator. In technical analysis, you generally use technical indicators to understand your asset better."},"techniques":{"title":"Techniques","description":"One of our biggest tips is to watch other traders and learn from their mistakes. But how can you use that in your trading techniques and analysis?"},"conclusion-3":{"title":"Conclusion","description":"Finalize your knowledge in technical analysis with our finals tips and tricks on improving your strategy. Make sure to practice before you actually get into it."},"technical-instruments":{"title":"Technical Instruments","description":"Avoid confusion and learn how to differentiate technical instruments and indicators, as well as a sentiment-based strategy and fundamental instruments."},"price-action":{"title":"Price Action","description":"Learn how to understand the price actions in currency markets, and why they are considered one of the most underestimated details in trading. It is time to turn profits with the most undervalued types of knowledge."},"analyzing-the-forex-market":{"title":"Analyzing the Forex Market","description":"Learn how to make profits from one of the most volatile markets with us. Whether it's going up or down, it's still possible to make a profit."},"technical-indicators-2":{"title":"Technical Indicators","description":"Even if you don't know anything about technical analysis, the technical indicators can teach you how to predict the future of the currency pair."},"remnant-supply-and-demand":{"title":"Remnant Supply and Demand","description":"Yes, supply grows with demand, and price action changes along with it. Is there a way to predict supply and demand. If yes, how?"},"charts":{"title":"Charts","description":"The sooner you recognize the patterns, the sooner you will be able to turn profits. However, identifying similar charts needs a good eye. How can you use it to your advantage?"},"conclusion-4":{"title":"Conclusion","description":"Simple suggestions and tips are added for the whole course in our final conclusion."},"sentiment-based-strategy":{"title":"Sentiment-based Strategy","description":"We made sure to include the simplest explanations possible for you to be able to understand some of the most complicated strategies in trading."},"economic-theories-and-data":{"title":"Economic Theories and Data","description":"Take advantage of the foremost information in trading via your economic theories and data and use the strength of historical knowledge to create the perfect strategy."},"fundamental-instruments":{"title":"Fundamental Instruments","description":"Even if you don't understand the fundamental analysis strategy, you can use simple instruments to help build a good basis for your future trades."},"forex-indicators":{"title":"Forex Indicators","description":"Knowledge is power and success comes from knowledge! The more you know the better, and this is especially true when you're trading Forex. To become the best trader you need to learn technical analyses. This video lesson will explain the significance of Forex Indicators. Do you want to know what they mean and how to act when you see one? Click on the video and you'll find out."},"forex-rsi-stochastic-oscillator":{"title":"Forex RSI Stochastic Oscillator","description":"Here goes another complicated name that may sound intimidating. Don't fret, it's not that hard. In this chapter we'll talk about this particular indicator. Basically, the Stochastic Oscillator is a popular trading indicator that follows the speed of price action momentum. It can help you identify when a market is overbought or oversold. Go ahead, click on the video to know more!"},"forex-atr-average-true-range":{"title":"Forex ATR Average True Range","description":"ATR, Average True Range, is a technical analysis indicator that measures market volatility. Essentially, it is derived from the 14-day moving average of a series of true range indicators. This chapter will explain ATR's true meaning and will teach you how to calculate ATR. Click on the video and you'll see that the Average True Range is quite simple to calculate!"},"forex-moving-average":{"title":"Forex Moving Average","description":"Moving averages are one of the most used and most useful tools in overall trading, but there are specific details you must know in Forex. How do you set a moving average and what should you be looking for when it comes to currency trading? Watch our video to learn more."},"forex-moving-average-convergence-divergence-macd":{"title":"Forex Moving Average Convergence Divergence MACD","description":"Many traders do not know how to use the moving average convergence divergence MACD in forex, and it proves to be one of the most useful tools. With TraderCademy, you will be able to learn everything you need to know about this tool, especially when it comes to Forex Trading."},"forex-average-directional-index-adx":{"title":"Forex Average Directional Index ADX","description":"What does the Average Direction Index ADX show you? How can you use it to help benefit your Forex trades? Our experts will explain everything quickly and easily. ADX is one of the most important details you need to consider while trading, especially Forex."},"forex-bollinger-bands":{"title":"Forex Bollinger Bands","description":"Have you been confused by the Bollinger Bands? It is not surprising, as many traders misunderstand the concept and make crucial mistakes while trading. When it comes to Forex, Bollinger Bands can aid your trading whether you are a novice or a professional. Let us help you make sure that you learn everything that you need to know about this concept."},"forex-parabolic-sar":{"title":"Forex Parabolic SAR","description":"The Parabolic SAR is the easiest tool you can use to gain more insight on the markets. Traders often underestimate the usefulness of this tool, and skip the analysis. In reality, it provides a lot of information that you might have missed with other tools. TraderCademy will teach you everything you need to know about the Parabolic SAR."},"forex-ichimoku-kinko-hyo":{"title":"Forex Ichimoku Kinko Hyo","description":"This name may sound confusing, but don't be scared. We'll explain everything. Ichimoku Kinko Hyo, also known as IKH, is a specific indicator that gauges future price momentum. It determines futures areas of support and resistance. This chapter will explain how to determine this very fascinating indicator. Watch the video to find out more."},"forex-pivot-points":{"title":"Forex Pivot Points","description":"This video lesson opens doors to another forex indicator. Forex Pivot Point is an indicator developed by floor traders in the commodities markets to determine potential turning points, also known as \"pivots.\" Usually, day traders use pivot points as a way to determine when market sentiment has gone from bullish to bearish or vice versa. Don't wait, be quick and click on the video to find out more."},"candlesticks":{"title":"Candlesticks","description":"Everyone starts from the basics… Candlesticks are the most important and essential pattern you'll see. You need to be able to read candlestick charts. This video will explain all the important details you need to know. Click on this video lesson, listen carefully, and learn how to read candlesticks' patterns fluently."},"doji-candlestick-in-forex":{"title":"Doji Candlestick in Forex","description":"Doji candlesticks look like crosses, inverted crosses or plus signs. But how do these Doji candlesticks come in handy when trading Forex? Usually, they represent incision in the market. Make your trading more precise than ever. Click on this video and learn how to distinguish Doji candlestick patterns."},"marubazu-candlestick-in-forex":{"title":"Marubazu Candlestick in Forex","description":"Marubozu is the name of the Japanese candlesticks formation used in technical analysis to indicate whether a stock will move vigorously in one direction or another. The Marubazu trading signal has no real implications on its own; however, it is beneficial in situations like breakouts or reversals."},"hammer-and-hanging-man-candlesticks":{"title":"Hammer and Hanging Man Candlesticks","description":"Hammer and Hanging Man Candlesticks are the most common and the easiest to identify. They have the same shape, but their placement defines the following pattern. Hammers are bullish, while hanging men are bearish. So then, how can you use this to your advantage?"},"shooting-star-and-inverted-hammer-candlestick":{"title":"Shooting Star and Inverted Hammer Candlestick","description":"As a trader, you'll have to analyze all the technical aspects of pattern variability and movement habits. In this video, you'll learn about both Shoot Star and Inverted Hammer candlestick patterns. The names may sound ridiculous, but if you master the technique to determine their patterns, you'll be able to predict trade outcomes all the time."},"bullish-piercing-pattern":{"title":"Bullish Piercing Pattern","description":"Bullish piercing patterns often signal potential for high profits and are one of the most important patterns recognized on the market. Most of the experts use the bullish piercing pattern to predict the outcome of their trade. Once spotted, the market often gets flooded with trades. Make sure you learn this important trading detail with us."},"dark-cloud-cover-pattern":{"title":"Dark Cloud Cover Pattern","description":"Dark cloud cover is a bearish reversal candlestick pattern. The pattern is significant as it shows a shift in the momentum from the upside to the downside. In this lesson, you'll learn how to distinguish cloud movement. You will also grasp a marvelous technique to forecast future patterns. Thus, you'll be able to hide from the clouds before it starts raining."},"bullish-and-bearish-engulfing-patterns":{"title":"Bullish and Bearish Engulfing Patterns","description":"This video will explain how to categorize and determine sophisticated bullish and bearish patterns. These two patterns are opposites. The Bullish-engulfing pattern occurs after a price moves lower and indicates higher rates to come. The Bearish-engulfing pattern is a technical chart pattern that signals lower prices to come."},"tweezer-tops-and-bottoms":{"title":"Tweezer Tops and Bottoms","description":"As a futures trader, you need to learn about the tweezer tops and bottoms. In this video lesson, you'll learn how to understand the Tweezer Top and Bottom formation work. The Tweezer Top and Bottom reversal pattern can visually indicate a transfer of power and sentiment from the bulls and the bears. Distinguishing these patterns is vital in trading. Watch this video, and you'll learn even more!"},"3-white-soldiers-3-black-crows":{"title":"3 White Soldiers 3 Black Crows","description":"Learn how to distinguish forex candlesticks signals, the way their bodies and their shadow interact. Be one of the few traders who do not skip over these signals and precisely predict the outcome. In this chapter, you will discover how to catch these essential indicators in charts and seize the moment to gain profit."},"3-inside-up-and-3-outside-up-candlestick-pattern":{"title":"3 Inside Up and 3 Outside Up Candlestick Pattern","description":"Identifying three inside up and three outside up candlestick patterns can be quite hard for a novice trader, sometimes even for experts. Our easy video tutorial will teach you how to quickly identify these patterns and use them to your advantage. What comes after these candlesticks and how should you act?"},"rising-and-falling-three-methods":{"title":"Rising and Falling Three Methods","description":"This lesson explains how to determine the Three Methods pattern, which is a trend continuation pattern that can appear in an uptrend or a downtrend. The three methods pattern consists of at least five candlesticks, but may include even more. Click on this video and learn how to determine the three methods on your own."},"morning-and-evening-star-patterns":{"title":"Morning and Evening Star Patterns","description":"You do not have to be born under a lucky start to learn how to make profit and trade successfully. In this video lesson, you'll learn about the Morning and Evening Star Patterns. These \"otherworldly\" patterns are used for trend identification and with the recognition of bearish and bullish top trends. Click the video and learn more."},"how-to-trade-with-leverage":{"title":"How To Trade With Leverage","description":"Welcome to the first lesson of the Basic Forex Education course. As a future successful trader, you need to know what leverage is. Mainly, any technique that involved borrowed funds, involves the use of various financial instruments, or rented capital in the purchase of an asset is known as leverage. It can arise in several situations. In this class, you will learn about force, what is it, and how to you use to your advantage."},"why-trade-forex":{"title":"Why Trade Forex","description":"Forex trading has become quite popular in the past decade. It is the largest market in terms of daily transaction volume, and it is almost the most liquid. Also, the market is the most accessible and is open 24/7. There are several reasons why investors choose Forex over trading stocks. Click on the video to find out why."},"when-to-trade-with-forex":{"title":"When to Trade with Forex","description":"Though the Forex market may seem like it never stops, you need to consider the possibilities that go along with right timing. No kind of trading brings good profits without the perfectly placed trade - and timing is a make or break it."},"trading-terminology-or-where-am-i-going-long":{"title":"Trading Terminology Or Where Am I Going Long","description":"As a beginner trader, you are going to come across lots of terms and sayings that you will probably not understand the first time you look at them. Do not worry, by the end of the video you will know all the basics of the current terminology and where you can look for more definitions."},"how-to-place-a-trade-in-forex":{"title":"How To Place A Trade In Forex","description":"This video lesson is quite important, as it will explain the essential basics of overall trading. You will master the fundamental technique of placing trades in Forex. If you want to know how to select a currency pair, analyze the market, read quotes, pick a correct position, then click on the video and find out everything you need to know."},"what-is-a-pip":{"title":"What is a PIP?","description":"The word may sound funny, but it is a relevant term and is an acronym for percentage in point or price interest point in an exchange rate of a currency pair. Usually, Forex currency pairs are quoted in terms of 'pips.' However, in practical terms, a pip is one-hundredth of one percent, or the fourth decimal place (0.0001). Click on this video, and you will find out even more about pips."},"types-of-forex-orders":{"title":"Types of Forex Orders","description":"In this video, we will discuss the term order and its meaning in this context. Traders need to have knowledge of different types of orders. This is because different brokers accept different types of Forex orders. All brokers provide some basic order types. You'll learn how to distinguish all types of Forex orders. We'll explain how to create your trading technique, and to make sure that you fully understand your broker's order entry systems, before any execution is done. Hurry up and jump into the video lesson."},"technical-analysis-in-forex":{"title":"Technical Analysis In Forex","description":"You should know that support and resistance forms are the basis of Forex technical analysis. Beginner Traders usually ask many questions; especially the ones that concern how low is low and how high is high.This video lesson will help you out. We will try to explain how Support and Resistance in Forex works. Click on our video lesson to get straight to it!"},"types-of-forex-charts":{"title":"Types of Forex Charts","description":"There are many different types of Forex charts. What are the most important ones that you need to know. Why is their knowledge necessary? Watch this video to learn more."},"trendlines":{"title":"Trendlines","description":"Trendlines are an important part of the trading analysis. As a trader, you have to know how to identify them. Trendlines make an excellent tool for traders if they are used correctly. In this video lesson, you will learn how to identify Trendlines and use them to your advantage in trading. The following tips were designed to help you use Trendlines as part of your future trading strategy."},"fundamental-analysis-in-forex":{"title":"Fundamental Analysis in Forex","description":"Traders need to know a way of looking at the Forex market by analyzing economic, social, and political forces that may affect the supply and demand of an asset.In other words, you have to look at different factors to determine the state of the economy and then make your move.You have to understand the reasons of why and how certain events impact the Forex market.No worries, there is nothing too complicated in the fundamental analysis, and in a couple of minutes, you will see that it is not that hard. With a little bit of practice and help from our video lesson, you will succeed!"},"support-and-resistance-in-forex":{"title":"Support and Resistance in Forex","description":"You should know that support and resistance forms are the basis of Forex technical analysis. Beginner traders usually ask many questions, especially ones that concern how low is low and how high is high.This video lesson will help you out. We will try to explain how the Support and Resistance in Forex works. Hurry up and jump into this video lesson!"},"introduction-to-mt5":{"title":"Introduction to MT5","description":"MetaTrader 5 is one of the most popular and latest trading platforms used across the world. It is also known as a very flexible trading terminal which is usually used for trading of CFSs and FX. Most of the forex traders consider MT5 as their first choice as it is very easy to use and it also offers an assortment of add-ons to enhance the trading experience.MetaTrader 5 provides an array of opportunities for a pool of actions in the financial markets, such as trading, analysis (fundamental analysis and technical analysis), testing of trading strategies, the development and introduction of trading robots, and development of personalized technical indicators and scripts."},"forex-markets-basics-and-trading-examples":{"title":"Forex Markets Basics and Trading Examples","description":"Unlike other financial markets like the New York Stock Exchange or the London Stock Exchange, the forex market has neither a physical location nor a central exchange. The forex market is considered an Over-the-Counter (OTC), or \"Interbank\" market due to the fact that the entire market is run electronically, within a network of banks, continuously over a 24-hour period. This means that the spot forex market is spread all over the globe with no central location. Trades can take place anywhere."},"commodities-markets-basics-and-trading-examples":{"title":"Commodities Markets Basics and Trading Examples","description":"A new bull market is already under way, and it is in commodities. If you look around your homes or enter a supermarket, you are surrounded by commodities that are traded around the world. When you get into your car, you are surrounded by other widely traded commodities. Without the futures markets setting and regulating prices, the basics items we all need in life would be scarce and often expensive. These essentials include crude oil, natural gas, corn, wheat, soybeans, copper, silver, gold, platinum, palladium, sugar, coffee, rice, lumber etc.As economies in Asia continue to grow, there will be a strong worldwide demand for all commodities. China, in particular, has moved quickly from a major exporter to an importer of commodities, consuming copper, oil, soybeans and other raw materials voraciously. With more than 1.3 billion people, China faces a considerable demand for commodities."},"market-news-trading-technique":{"title":"Market News Trading Technique","description":"In the equities market, fundamental analysis looks to measure a company's true value and to base investments upon this type of calculation. To some extent, the same is done in the retail forex market, where forex fundamental traders evaluate currencies, and their countries, like companies and use economic announcements to gain an idea of the currency's true value.All of the news reports, economic data and political events that come out about a country are similar to news that comes out about a stock in that it is used by investors to gain an idea of value. This value changes over time due to many factors, including economic growth and financial strength. Fundamental traders look at all of this information to evaluate a country's currency."},"trend-trading":{"title":"Trend Trading","description":"Trend trading is a trading strategy that attempts to capture gains through the analysis of a security's momentum in a particular direction. Trend traders enter into a long position when a security is trending upward and/or enter a short position when a security is trending lower.Trend trading strategies assume that a security will continue to move along its current trend and often contain a take-profit or stop-loss provision if there are any signs of a reversal. It can be used by short-, intermediate- or long-term traders. Regardless of their chosen time frame, traders will remain in their position until they believe the trend has reversed, although reversals may occur at different times for each time frame."},"trading-global-indices":{"title":"Trading Global Indices","description":"More than five thousand stocks trade every day on the New York Stock Exchange and Nasdaq - the two largest stock exchanges in the U.S.With so many stocks moving and up and down throughout the trading session - and not all in the same direction, either - how is it that people can say whether the market has had a good day or a bad day?It turns out, when people talk about the stock market's performance, they are referring to a market index, such as the Dow Jones Industrial Average, commonly called \"the Dow,\" or the Standard & Poor's 500 - or S&P 500 for short."}}}